<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Guía turística de Orizaba con información sobre lugares, actividades y contacto.">
    <meta name="keywords" content="Orizaba, guía turística, lugares, actividades, contacto">
    <title>Inicio - Gu&iacute;a Tur&iacute;stica de Orizaba</title>
    <link rel="stylesheet" href="../../css/inicio.css">
</head>
<body>
    <header>
        <h1 class="header">Bienvenidos a la Gu&iacute;a Tur&iacute;stica de Orizaba</h1>
        <p>Descubre los encantos de este Pueblo Mágico: cultura, naturaleza y tradiciones.</p>
    </header>

    <nav>
        <h2 class="nav">Explora Orizaba</h2>
        <p class="nav">Haz clic en los siguientes enlaces para conocer m&aacute;s sobre lo que Orizaba tiene para ti:</p>
        <ul>
            <li>
                <a href="lugares.html">Lugares de Inter&eacute;s</a> - Conoce los destinos m&aacute;s emblem&aacute;ticos de Orizaba. Desde la imponente Cascada de Texolo hasta el hist&oacute;rico Centro de Orizaba, te sorprender&aacute; cada rinc&oacute;n.
            </li>
            <li>
                <a href="mapa.html">Mapa Interactivo</a> - Utiliza nuestro mapa interactivo para explorar las mejores rutas tur&iacute;sticas, encontrar direcciones y no perderte nada en tu visita.
            </li>
            <li>
                <a href="contacto.html">Contacto</a> - Si tienes alguna pregunta o deseas m&aacute;s informaci&oacute;n, visita nuestra p&aacute;gina de contacto. Estamos aqu&iacute; para ayudarte en tu experiencia.
            </li>
            <li>
                <a href="../../index.html">Anterior</a> - Regresa al inicio de la p&aacute;gina
            </li>
        </ul>
    </nav>

    <main>
        <section>
            <h2>Informaci&oacute;n sobre Orizaba</h2>
            <p>Orizaba es una ciudad ubicada en el estado de Veracruz, conocida por su hermoso paisaje natural y su rica historia. En sus calles, la arquitectura colonial se mezcla con la modernidad, creando un ambiente &uacute;nico. Entre sus principales atractivos tur&iacute;sticos se encuentran el volc&aacute;n Pico de Orizaba, el m&aacute;s alto de M&eacute;xico, un lugar perfecto para los amantes de la naturaleza y la fotograf&iacute;a.</p>
            <img src="../../media/calles.jpg" width="400" height="350">
        </section>

        <section>
            <h2>Actividades y Atracciones</h2>
            <p>Adem&aacute;s de sus hermosos paisajes, Orizaba ofrece actividades para todos los gustos. Puedes disfrutar de paseos en el telef&eacute;rico, recorrer su famoso Museo de Arte del Estado o visitar el Parque Nacional Pico de Orizaba. La ciudad tambi&eacute;n es conocida por su arquitectura, especialmente la Iglesia de San Miguel, un referente del barroco en la regi&oacute;n.</p>
            <img src="../../media/sanmiguel.jpg" width="400" height="350">
        </section>

        <section>
            <h2>Clima y Mejor &Eacute;poca para Visitar</h2>
            <p>Orizaba tiene un clima templado, lo que lo convierte en un destino ideal para visitar durante todo el año. Sin embargo, los meses de octubre a marzo son perfectos para disfrutar de sus actividades al aire libre debido a la temperatura agradable y los cielos despejados. En verano, las lluvias pueden hacer que algunas actividades al aire libre sean menos c&oacute;modas.</p>
            <img src="../../media/lluvia.jpeg" width="400" height="350">
        </section>
    </main>

    <aside>
        <section class="introduccion">
            <h2 class="aside">¿Por qu&eacute; visitar Orizaba?</h2>
            <p class="aside">Orizaba es un destino tur&iacute;stico lleno de historia, naturaleza y cultura. Su hermoso entorno lo convierte en el lugar ideal para unas vacaciones llenas de aventura y relajaci&oacute;n.</p>
        </section>
        <section class="destinos">
            <h2 class="aside2">Destinos Recomendados</h2>
            <ul>
                <li class="aside"><a href="lugares.html#tele">Telef&eacute;rico</a></li>
                <li class="aside"><a href="lugares.html#tobogan">Tobog&aacute;n de la montaña</a></li>
                <li class="aside"><a href="lugares.html#casa">Casavegas</a></li>
            </ul>
        </section>
    </aside>

    <footer>
        <p>&copy; 2025 Gu&iacute;a Tur&iacute;stica de Orizaba. Todos los derechos reservados.</p>
        
    </footer>
</body>
</html>