<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-widht,initial-scale=1.0">
<meta name="description" content="Pagina principal de historia de aplicaciones web y CV del participante">
    <title>Historia de la web</title>
    <style>
        body { font-family:Arial, sans-serif;margin:20px}
        nav a { margin-right: 15px; text-decoration:none;color:green;}
        body{background-color:bisque}
        
        h1{
            color:red
        }
        p {
            text-align: justify; 
        }
        
    </style>

</head>
<body>
    <nav>
        <a href="index.html">Regresar a inicio</a>
    </nav>
    <header>
        <h1>Demos un vistazo a una breve historia de la web</h1>
        <p>Bienvenido a esta p&aacute;gina dedicada a explorar la
             evoluci&oacute;n de la web a lo largo del tiempo. 
             Desde sus humildes inicios con la Web 1.0, donde predominaba
             el contenido est&aacute;tico, hasta la interacci&oacute;n din&aacute;mica de la Web 2.0 
             que permiti&oacute; el auge de las redes sociales y la colaboraci&oacute;n en l&iacute;nea.
             Descubre cómo la Web 3.0 trajo consigo la descentralizaci&oacute;n y los avances en
              inteligencia artificial, y c&oacute;mo la Web 4.0 est&aacute; dando forma al futuro 
              con tecnolog&iacute;as a&uacute;n m&aacute;s avanzadas y una integraci&oacute;n 
              m&aacute;s profunda en nuestra vida diaria.</p>
    </header>
    <nav>
        <a href="#historia">Historia</a>
        <a href="#Web 1.0">Web 1.0</a>
        <a href="#Web 2.0">Web 2.0</a>
        <a href="#Web 3.0">Web 3.0</a>
        <a href="#Web 4.0">Web 4.0</a>
    </nav>
    <section id="historia">
        <h2>Historia</h2>
        <p>La web es una herramienta fundamental en la sociedad actual, ya que ha transformado la
            manera en que nos comunicamos, trabajamos y accedemos a la informaci&oacute;n. 
            Desde su creaci&oacute;n, ha facilitado el acceso a conocimientos, recursos y servicios
            en todo el mundo, permitiendo la conexi&oacute;n global entre individuos, empresas y gobiernos.
            La Web 2.0 ha impulsado la colaboraci&oacute;n en l&iacute;nea, dando paso a las redes
            sociales, el intercambio de ideas y la participaci&oacute;n activa de los usuarios. 
            Con el advenimiento de la Web 3.0, la web ha comenzado a integrar tecnolog&iacute;as 
            avanzadas como la inteligencia artificial y el blockchain, mejorando la personalizaci&oacute;n
            y la seguridad en la interacci&oacute;n digital. En resumen, la web es crucial porque 
            facilita la democratizaci&oacute;n de la informaci&oacute;n y potencia el desarrollo 
            de nuevas oportunidades para todos.</p>

        <p>La historia de la web comienza en 1989, cuando Tim Berners-Lee desarroll&oacute; la World Wide
            Web (WWW) como un sistema para compartir informaci&oacute;n en red. La Web 1.0, 
            caracterizada por p&aacute;ginas est&aacute;ticas y navegaci&oacute;n limitada,
            fue el primer paso en esta evoluci&oacute;n. Con la llegada de la Web 2.0, la 
            interacci&oacute;n entre usuarios aument&oacute;, permitiendo la creaci&oacute;n de redes
            sociales, blogs y contenido colaborativo. Luego, la Web 3.0 introdujo la descentralizaci&oacute;n,
            el uso de blockchain y la inteligencia artificial para mejorar la experiencia en l&iacute;nea.
            Finalmente, la Web 4.0 busca integrar tecnolog&iacute;as avanzadas como la realidad aumentada
            y la automatizaci&oacute;n inteligente, transformando la manera en que interactuamos con el
            mundo digital.</p>
       <a href="#Web 4.0">Anterior: Web 4.0</a>
       <p></p>
        <a href="#Web 1.0">Siguiente: Web 1.0</a>
    </section>

    <section id="Web 1.0">
        <h2>Web 1.0</h2>
        <p>Durante esta fase, los navegadores web como Netscape Navigator e Internet Explorer
            desempe&ntilde;aron un papel crucial, aunque la experiencia era unidireccional, ya que
            las p&aacute;ginas eran est&aacute;ticas y los usuarios no pod&iacute;an interactuar de
            manera significativa con ellas. El contenido se manten&iacute;a fijo, lo que significa que
            cualquier actualizaci&oacute;n o cambio deb&iacute;a ser realizado manualmente por un 
            desarrollador en el c&oacute;digo de la p&aacute;gina.</p> 
            <p>Asimismo, los buscadores 
            comenzaron a cobrar importancia, con plataformas como Yahoo!, que ayudaron a organizar 
            la informaci&oacute;n y hacerla m&aacute;s accesible. Aunque la Web 1.0 proporcion&oacute;
            una base s&oacute;lida para la web moderna, carec&iacute;a de la interactividad y dinamismo
            que caracterizan a las versiones posteriores de la red.</p>
       <a href="#historia">Anterior: Historia</a>
       <p></p>
        <a href="#Web 2.0">Siguiente: Web 2.0</a>
    </section>

    <section id="Web 2.0">
        <h2>Web 2.0</h2>
        <p>La Web 2.0, surgida a principios de los a&ntilde;os 2000, marc&oacute; un cambio importante
            respecto a la Web 1.0, transformando la manera en que los usuarios interactuaban con la red. 
            A diferencia de la Web 1.0, que se basaba en p&aacute;ginas est&aacute;ticas, la Web 2.0 trajo
            consigo la posibilidad de interactuar y colaborar en tiempo real a trav&eacute;s de plataformas
            din&aacute;micas y contenido generado por los propios usuarios. Con la llegada de las redes 
            sociales, como Facebook, Twitter y YouTube, la Web 2.0 permitió que las personas no solo 
            consumieran informaci&oacute;n, sino que la crearan, compartieran y comentaran.</p> 
        <p>El auge de las plataformas de colaboraci&oacute;n, como Wikipedia, transform&oacute; 
            la manera en que se generaba y compart&iacute;a el conocimiento, con un enfoque centrado 
            en la participaci&oacute;n de los usuarios. Los blogs y foros cobraron protagonismo, brindando
            espacios para la expresi&oacute;n individual y la creaci&oacute;n de comunidades en l&iacute;nea.
            Los navegadores comenzaron a incorporar nuevas funcionalidades, como el soporte para 
            aplicaciones web, lo que facilit&oacute; el acceso a herramientas como Google Docs, que 
            permit&iacute;an a los usuarios trabajar de manera colaborativa en documentos en tiempo real.</p>

        <p>El concepto de "web social" fue una de las principales caracter&iacute;sticas de la Web 2.0, 
            ya que se enfocaba en crear experiencias compartidas y colaborativas. La tecnolog&iacute;a de
            AJAX (Asynchronous JavaScript and XML) desempe&ntilde;&oacute; un papel fundamental al 
            permitir la actualizaci&oacute;n de contenidos de forma r&aacute;pida sin necesidad de 
            recargar la p&aacute;gina, mejorando la experiencia del usuario. A su vez, la 
            personalizaci&oacute;n de los sitios web seg&uacute;n las preferencias de los usuarios
            se convirti&oacute; en una caracter&iacute;stica clave, lo que posibilit&oacute; la 
            evoluci&oacute;n de plataformas m&aacute;s interactivas y atractivas.</p> 

        <p>Sin lugar a dudas, la Web 2.0 cambi&oacute; la forma en que nos conectamos, comunicamos y compartimos informaci&oacute;n. Este modelo din&aacute;mico y colaborativo allan&oacute; el camino para el desarrollo de aplicaciones web m&aacute;s complejas y ricas en funci&oacute;nes, haciendo que la web pasara de ser una simple herramienta de lectura a convertirse en una plataforma activa y participativa para millones de usuarios en todo el mundo.</p>
       <a href="#Web 1.0">Anterior: Web 1.0</a>
       <p></p>
        <a href="#Web 3.0">Siguiente: Web 3.0</a>
    </section>

    <section id="Web 3.0">
        <h2>Web 3.0</h2>
        <p>La Web 3.0, tambi&eacute;n conocida como la "web sem&aacute;ntica", marc&oacute; una nueva era 
            en la evoluci&oacute;n de la internet, enfoc&aacute;ndose en hacer que la web sea m&aacute;s
            inteligente y personalizada. Esta etapa de la web se caracteriza por la capacidad de los 
            sistemas para comprender y procesar el significado de la informaci&oacute;n, y no solo los datos 
            crudos. A trav&eacute;s de avances en inteligencia artificial (IA), aprendizaje autom&aacute;tico 
            y procesamiento de lenguaje natural, la Web 3.0 permite que las m&aacute;quinas comprendan mejor 
            las necesidades de los usuarios y ofrezcan contenido m&aacute;s relevante y adaptado.</p> 

        <p>Uno de los pilares de la Web 3.0 es la descentralizaci&oacute;n. Con el auge de las criptomonedas 
            y las tecnolog&iacute;as basadas en blockchain, como Ethereum y Bitcoin, la Web 3.0 permite 
            una distribuci&oacute;n de datos sin depender de un servidor centralizado. Esto no solo 
            garantiza mayor seguridad, sino que también fomenta una mayor transparencia y privacidad, 
            lo cual representa un avance significativo respecto a las versiones anteriores de la web.</p>

        <p>En la Web 3.0, la experiencia del usuario se ha vuelto m&aacute;s inmersiva gracias al uso de 
            tecnol&oacute;g&iacute;as como la realidad aumentada (AR) y la realidad virtual (VR). Estas 
            innovaciones permiten interactuar con el contenido de manera m&aacute;s rica y envolvente. 
            Los asistentes virtuales y las aplicaciones inteligentes, como Siri, Alexa y Google Assistant, 
            aprovechan la inteligencia artificial para ofrecer servicios m&aacute;s personalizados, 
            entendiendo mejor las consultas y las preferencias del usuario.</p> 

        <p>La Web 3.0 no solo se enfoca en la personalizaci&oacute;n, sino tambi&eacute;n en la interoperabilidad
             entre plataformas. Las aplicaciones pueden integrarse de manera m&aacute;s fluida, creando 
             un entorno web m&aacute;s cohesivo. Las API (interfaz de programaci&oacute;n de aplicaciones) 
             juegan un papel crucial en este proceso, ya que permiten que diferentes servicios y plataformas 
             se comuniquen de manera eficiente.</p> 

        <p>En resumen, la Web 3.0 está transformando la internet en un espacio m&aacute;s inteligente, 
            privado y descentralizado, donde la interacci&oacute;n y la personalizaci&oacute;n juegan 
            un papel central. A medida que la inteligencia artificial y otras tecnolog&iacute;as emergentes 
            sigan avanzando, la Web 3.0 est&aacute; preparada para revolucionar la manera en que interactuamos
             con la red, brindando una experiencia mucho m&aacute;s eficiente e inmersiva.</p>
       <a href="#Web 2.0">Anterior: Web 2.0</a>
       <p></p>
        <a href="#Web 4.0">Siguiente: Web 4.0</a>
    </section>

    <section id="Web 4.0">
        <h2>Web 4.0</h2>
        <p>La Web 4.0 es la pr&oacute;xima fase evolutiva de la red, y aunque todav&iacute;a se encuentra 
            en desarrollo, promete ser una revoluci&oacute;n en cuanto a la integraci&oacute;n de la 
            tecnolog&iacute;a en la vida diaria. Conocida como la "web inteligente" o "web integrada", 
            la Web 4.0 combina la inteligencia artificial avanzada, el Internet de las Cosas (IoT), 
            la automatizaci&oacute;n y el aprendizaje profundo para crear un entorno digital completamente 
            conectado y personalizado. En esta etapa, las plataformas web ser&aacute;n capaces de anticipar
             las necesidades del usuario y ofrecer soluciones autom&aacute;ticas e inmediatas.</p> 
             
        <p>Una de las principales caracter&iacute;sticas de la Web 4.0 es la hiperconectividad. 
            Los dispositivos, m&aacute;s all&aacute; de los computadores y smartphones, estar&aacute;n 
            conectados a la red a trav&eacute;s del Internet de las Cosas, creando un ecosistema digital 
            sin fricciones. Desde electrodom&eacute;sticos inteligentes hasta autom&oacute;viles 
            aut&oacute;nomos, la Web 4.0 permitir&aacute la comunicaci&oacute;n fluida entre todos 
            estos dispositivos, lo que transformar&aacute; la manera en que vivimos y trabajamos. 
            Las ciudades inteligentes y los hogares automatizados ser&aacute;n una realidad cotidiana, 
            facilitando la gesti&oacute;n de recursos y mejorando la calidad de vida.</p> 
            
    <p>La Web 4.0 tambi&eacute;n estar&aacute; caracterizada por la aplicaci&oacute;n de la inteligencia 
        artificial de manera m&aacute;s avanzada. Los asistentes virtuales evolucionar&aacute;n hacia 
        agentes cognitivos m&aacute;s sofisticados, capaces de mantener conversaciones complejas y 
        realizar tareas autom&aacute;ticas, mejorando la experiencia del usuario y ofreciendo soluciones 
        a medida. La personalizaci&oacute;n ser&aacute; tan profunda que las plataformas sabr&aacute;n
        predecir las intenciones del usuario y actuar&aacute;n antes de que este las solicite.</p> 
        
    <p>La realidad aumentada (AR) y la realidad virtual (VR) se integrarán de manera m&aacute;s 
        fluida en la Web 4.0, creando experiencias inmersivas en todos los aspectos de la vida 
        cotidiana. El uso de estas tecnolog&iacute;as se ampliar&aacute; a sectores como la 
        educaci&oacute;n, la medicina, el entretenimiento y el comercio, ofreciendo experiencias 
        interactivas que permitir&aacute a los usuarios experimentar el mundo de manera digitalmente 
        enriquecida. Las interfaces de usuario se volver&aacute;n m&aacute;s intuitivas, permitiendo 
        interacciones sin contacto f&iacute;sico, como gestos, comandos de voz o incluso el control 
        cerebral.</p> 
        
    <p>En cuanto a la seguridad y la privacidad, la Web 4.0 promete ser mucho m&aacute;s segura 
        gracias al uso de criptograf&iacute;a avanzada y sistemas de autenticaci&oacute;n 
        biom&eacute;trica. Los usuarios tendr&aacute;n un control total sobre sus datos, con sistemas 
        que garanticen su privacidad y protejan la informaci&oacute;n personal. Al mismo tiempo, el 
        modelo descentralizado de la Web 3.0 seguir&aacute en pie, pero con m&aacute;s aplicaciones 
        y una mayor confiabilidad.</p> <p>En resumen, la Web 4.0 representar&aacute un salto 
        cu&aacute;ntico en la evoluci&oacute;n de la red, donde la inteligencia artificial, la 
        conectividad global y la personalizaci&oacute;n avanzada transformar&aacute la manera en 
        que interactuamos con el mundo digital. Esta nueva etapa promete integrar la tecnolog&iacute;a 
        de manera profunda en nuestra vida cotidiana, brindando soluciones autom&aacute;ticas, 
        experiencias inmersivas y una mayor eficiencia en todos los aspectos.</p>
       <a href="#Web 3.0">Anterior: Web 3.0</a>
       <p></p>
        <a href="#historia">Siguiente: historia</a>
    </section>

</body>













</html>